{
  "title": "Paneer korma",
  "description": "Cook this recipe inspired by saag paneer in just 30 minutes. It's a flavourful veggie curry that's heady with fresh ginger and cardamom. Serve with rice or naan breads",
  "cuisine": "Indian",
  "level": "Easy",
  "ingredients": [
    "3 tbsp vegetable oil",
    "225g block of paneer, cut into 2cm cubes",
    "1 large onion, roughly chopped",
    "thumb-sized piece of ginger, peeled",
    "2 large garlic cloves",
    "5 tbsp korma paste",
    "3 cardamom pods, crushed",
    "70g ground almonds",
    "500ml vegetable stock",
    "150g spinach",
    "100g Greek yogurt",
    "rice or naan breads, to serve (optional)"
  ],
  "method": [
    "Heat 1 tbsp of the oil in a deep frying pan over a medium-high heat. Add the paneer cubes and fry for 5 mins, turning regularly, so each side is golden brown. Remove with tongs and put on a plate lined with kitchen paper.",
    "Put the onion, ginger and garlic in a food processor with a splash of water and blitz until completely smooth. Heat the remaining oil in the frying pan over a medium-low heat. Add the onion mixture and a pinch of salt, and fry for 10 mins or until lightly golden. Add the korma paste and cardamom, and fry for 1 min. Stir in the ground almonds and fry for 1 min to make a thick paste.",
    "Add the stock, bring to a simmer and cook for 5-10 mins, uncovered, or until reduced a little. Add the spinach to the sauce and cook for 5 mins. Stir through the yogurt and paneer, and season generously. Serve with rice or warm naan breads."
  ],
  "time": {
    "preparation": "5 mins",
    "cooking": "25 mins"
  },
  "serves": "4",
  "categories": ["Less than 30 min"],
  "image": "https://res.cloudinary.com/dihsjevvi/image/upload/v1694669511/cleanbite-recipe-app/recipes/Paneer-Korma_jleniw.jpg",
  "nutrition": {
    "kcal": "509",
    "fat": "29g",
    "saturates": "12g",
    "carbs": "21g",
    "sugars": "12g",
    "fibre": "16g",
    "protein": "33g",
    "salt": "0.7g"
  }
}
